package com.training.unit03.main;

public class Task01 {

	public static void main(String[] args) {
		// 	Выведите на экран следующий текст.
		
		String text;
		text = "Пройдет много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела, вспомнит\r\n"
					+ "тот далекий вечер, когда отец взял его с собой посмотреть на лед. Макондо было тогда небольшим\r\n"
					+ "селением с двумя десятками хижин, выстроенных из глины и бамбука на берегу реки, которая мчала\r\n"
					+ "свои прозрачные воды …";
		System.out.println(text);

	}

}
