package com.training.unit03.main;

public class Task06 {

	public static void main(String[] args) {
		// Вычислить значение выражения по формуле (все переменные принимают
		// значения)
		
		double a, b, c, d, result;
		a = 4;
		b = 1;
		c = 6;
		d = 3;
		
		result = (a*b - a*b - c) / (c*d);
		System.out.println(result);
	
	}

}
